/*新增十筆測資*/
INSERT INTO
    Book (ISBN, Name, Author, Introduction)
VALUES
    ('9787121376543', '繁星', '王小波', '一個失敗者的自白'),
    ('9787536692930', '活著', '余華', '一個普通人的非凡旅程'),
    (
        '9787544270873',
        '白夜行',
        '東野圭吾',
        '一場失控的愛情、一段荒謬的恩仇'
    ),
    ('9787208061644', '挪威的森林', '村上春樹', '一段青春的追憶'),
    (
        '9789573317241',
        '小王子',
        '安托萬·德·聖-埃克蘇佩里',
        '孤獨的小王子和他的星球歷險'
    ),
    (
        '9787536693111',
        '三體',
        '劉慈欣',
        '一部關於宇宙、時間、人性的奇幻之作'
    ),
    (
        '9787544275953',
        '人類群星閃耀時',
        '劉以鬯',
        '一個關於家族、時光和夢想的故事'
    ),
    ('9789573317242', '哈利波特', 'J.K.羅琳', '一個魔法世界的冒險故事'),
    ('9789573317243', '1984', '喬治·奧威爾', '一部預言性的政治小說'),
    (
        '9789573317244',
        '失落沮喪歌',
        '三毛',
        '記述生活琐事、體會生命哲理的散文集'
    );

/*參考book的資料補充10筆測資的資料*/
INSERT INTO
    Inventory (ISBN, StoreTime, Status)
VALUES
    ('9787121376543', '2022-01-01 10:00:00', '可借閱'),
    ('9787536692930', '2022-01-02 11:30:00', '可借閱'),
    ('9787544270873', '2022-01-03 09:45:00', '可借閱'),
    ('9787208061644', '2022-01-04 14:20:00', '可借閱'),
    ('9789573317241', '2022-01-05 12:15:00', '可借閱'),
    ('9787536693111', '2022-01-06 08:30:00', '可借閱'),
    ('9787544275953', '2022-01-07 16:00:00', '可借閱'),
    ('9789573317242', '2022-01-08 13:45:00', '可借閱'),
    ('9789573317243', '2022-01-09 11:00:00', '可借閱'),
    ('9789573317244', '2022-01-10 09:15:00', '可借閱');